Revit 2027 API
BuiltInFailures.WallFailures.TaperedWallAnglesControlledByType Property
 Cannot set angles on a tapered wall which has angles controlled by the type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TaperedWallAnglesControlledByType { get; }
Public Shared ReadOnly Property TaperedWallAnglesControlledByType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TaperedWallAnglesControlledByType {
	FailureDefinitionId^ get ();
}
static member TaperedWallAnglesControlledByType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace